#+title: Tema 12: Procesamiento de archivos

* Procesamiento de archivos binarios
- El procesamiento de archivos binarios es más complejo que el de texto
- Es necesario primero familiarizarse con cadenas binarias
- Las cadenas binarias son similares a las cadenas de texto, incluso comparten un API similar
- =Python= facilita mucho el manejo de binario gracias a la noción de cadenas binarias (en muchos otros lenguajes suele ser más complejo)
- Un cadena binaria esencialmente contiene una serie de bytes
- El byte es la unidad mínima que procesa la computadora (no se procesan bits individuales)
- En =Python= una cadena binaria literal empieza con la letra =b=

#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
  binario = b'hola mundo'
  print(type(binario))
  # mostrar bytes internos
  print(list(binario))
#+end_src  

#+RESULTS:
: <class 'bytes'>
: [104, 111, 108, 97, 32, 109, 117, 110, 100, 111]

- =Python= hace su mejor esfuerzo para tratar de imprimir como texto una cadena binaria, pero si no puede muestra símbolos especiales llamados =code points=

#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
  import os

  cadena = b'hola'
  # cadena aleatoria de bytes
  aleatoria = os.urandom(12)
  print(type(aleatoria))
  print(aleatoria)
  # bytes internos
  print(list(aleatoria))

#+end_src  

- Cualquier archivo se puede tratar como binario, incluso los archivos de texto (internamente todo es binario)
- Se verá cómo realizar las siguientes operaciones con archivos
  binarios:
  + Abrir archivo binario
  + Leer un archivo binario
  + Escribir en archivo binario

*** Leer con un for
- Se comporta similar a un archivo de texto
- La diferencia es que no se lee línea por línea, sino chunk por chunk
- Osea que se hace básicamente lo mismo que pasando el parámetro de tamaño de chunk a =read=
- El tamaño del chunk está determinado por aspectos del SO
- Se puede saber el tamaño del chunk de la siguiente manera
  #+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py
    import io
    print(io.DEFAULT_BUFFER_SIZE)
  #+end_src

#+RESULTS:
: 8192

#+begin_src python :session *py* :results output :exports both :tangle /tmp/test.py

  contenido = b''
  for chunk in open('archivo.bin', 'rb'):
      contenido += chunk

  print(contenido)    
#+end_src

